const qcm=[
  {
    "question": "ما هي الأسلحة الكيميائية التي استخدمت في الحرب العالمية الأولى؟",
    "options": ["الغازات السامة", "المدافع النووية", "القنابل الحرارية", "الليزر"],
    "correct_option": 0
  },
  {
    "question": "ما هو اسم السفينة التي تعرضت للغرق وأدت إلى دخول الولايات المتحدة في الحرب؟",
    "options": ["تيتانيك", "لوسيتانيا", "بليتشر", "ياماتو"],
    "correct_option": 1
  },
  {
    "question": "ما هو اتفاقية فيرساي؟",
    "options": ["اتفاقية تأسيس الأمم المتحدة", "اتفاقية لإنهاء الحرب العالمية الثانية", "اتفاقية لإنهاء الحرب العالمية الأولى", "اتفاقية لتقسيم ألمانيا"],
    "correct_option": 2
  },
  {
    "question": "من هم الحلفاء الرئيسيين في الحرب العالمية الأولى؟",
    "options": ["ألمانيا والنمسا والإمبراطورية العثمانية", "بريطانيا وفرنسا وروسيا", "اليابان وإيطاليا والولايات المتحدة", "الصين والهند وأستراليا"],
    "correct_option": 1
  },
  {
    "question": "ما هو العملية التي أدت إلى انتهاء الحرب العالمية الأولى؟",
    "options": ["عملية تروتسكي", "عملية فرساي", "عملية كايزر", "عملية أورلاندو"],
    "correct_option": 1
  },

]
export default qcm